import React from "react";

function page() {
  return (
    <section dir="rtl" className="text-right">
      <div className="bg-white shadow-lg rounded-lg mx-auto text-justify  w-[95%] md:w-[90%] lg:w-[80%] my-10 p-6">
        <h1 className="text-2xl font-bold mb-4">سياسة استخدام موقعنا</h1>
        <p className="mb-4">
          مرحبًا بكم في "HAWAAK"، ونتمنى لكم تجربة تسوق ممتعة وآمنة. من خلال
          استخدام موقعنا، فإنك تقبل الشروط والأحكام التالية. يرجى قراءة هذه
          السياسة بعناية:
        </p>
        <ol className="mb-4 space-y-4 list-decimal list-inside">
          <li>
            <strong>قبول الشروط:</strong> باستخدامك لموقعنا، فإنك توافق على
            الالتزام بجميع الشروط والأحكام المذكورة، بالإضافة إلى أي تغييرات قد
            تطرأ عليها في المستقبل.
          </li>
          <li>
            <strong>استخدام الموقع:</strong> يُسمح لك باستخدام الموقع لأغراض
            قانونية فقط. يجب عليك عدم استخدام الموقع بأي شكل من الأشكال يتعارض
            مع القوانين المحلية أو الدولية.
          </li>
          <li>
            <strong>حساب المستخدم:</strong> قد تحتاج إلى إنشاء حساب لاستخدام بعض
            ميزات الموقع. أنت مسؤول عن الحفاظ على سرية معلومات حسابك، ويجب عليك
            إبلاغنا على الفور عن أي استخدام غير مصرح به لحسابك.
          </li>
          <li>
            <strong>المنتجات والأسعار:</strong> نبذل قصارى جهدنا لتقديم معلومات
            دقيقة حول المنتجات والأسعار. ومع ذلك، قد تحدث أخطاء. نحتفظ بالحق في
            تعديل الأسعار أو إلغاء الطلبات في حال وجود أخطاء.
          </li>
          <li>
            <strong>المدفوعات:</strong> جميع المدفوعات تتم عبر وسائل آمنة. نضمن
            حماية معلوماتك الشخصية والمالية.
          </li>
          <li>
            <strong>الشحن والتسليم:</strong> نقدم خيارات شحن متنوعة. سيتم إبلاغك
            بمعلومات الشحن والتسليم بعد إتمام عملية الشراء.
          </li>
          <li>
            <strong>سياسة الإرجاع:</strong> إذا لم تكن راضيًا عن منتجك، يمكنك
            إرجاعه خلال فترة محددة. يجب أن يكون المنتج في حالته الأصلية، مع جميع
            الملحقات. يرجى مراجعة سياسة الإرجاع الخاصة بنا لمزيد من التفاصيل.
          </li>
          <li>
            <strong>الخصوصية:</strong> نحن نحترم خصوصيتك ونتعامل مع معلوماتك
            الشخصية وفقًا لسياسة الخصوصية الخاصة بنا. نستخدم معلوماتك فقط لتحسين
            تجربتك وتلبية احتياجاتك.
          </li>
          <li>
            <strong>التغييرات على السياسة:</strong> نحتفظ بالحق في تعديل هذه
            السياسة في أي وقت. سيتم إعلامك بالتغييرات من خلال نشرها على الموقع.
          </li>
        </ol>
        <p>
          جميع الصور والمحتوى الموجود على الموقع محمي بموجب حقوق الطبع والنشر.
          يُمنع نسخ، توزيع أو استخدام هذه الصور بدون إذن مسبق. . شكرًا لك على
          اختيار "HAWAAK"، ونتمنى لك تجربة تسوق رائعة!
        </p>
      </div>
    </section>
  );
}

export default page;
